package Homework.homework1;

import java.util.Scanner;
public class Task3_Calculator {
    public static void main(String[] args) {

// Реализовать программу, выводящую на экран результаты сложения, вычитания, умножения и деления двух чисел.
// Каждая из арифметических операций должна быть реализована как отдельный метод.

}
 Scanner scanner = new Scanner(System.in); {

        System.out.println("Please, Enter 1 - Number (int): ");
        int numberOne = scanner.nextInt();

        System.out.println("Please, Enter 2 - Number (int): ");
        int numberTwo = scanner.nextInt();

        double numberResult = 0;
        String formatResult = "%d %c %d = %.2f\n";


    }

    }










